transient/coarse/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    airInlet
    {
        type            calculated;
        value           uniform 0;
    }
    airOutlet
    {
        type            calculated;
        value           uniform 0;
    }
    jetInlet
    {
        type            calculated;
        value           uniform 0;
    }
    jetOutlet
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    fastWalls
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    axis
    {
        type            empty;
    }
    sideA
    {
        type            wedge;
    }
    sideB
    {
        type            wedge;
    }
}


// ************************************************************************* //
